package com.javarush.task.task01.task0138;

/* 
Любимое стихотворение
В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки «Мое любимое стихотворение:».
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        System.out.println("Мое любимое стихотворение: Строчка 1");
        System.out.println("Мое любимое стихотворение: Строчка 2");
        System.out.println("Мое любимое стихотворение: Строчка 3");
        System.out.println("Мое любимое стихотворение: Строчка 4");
        //напишите тут ваш код
    }
}